_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ДополнительныеПараметрыПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ДополнительныеПараметрыПоДоговору</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_ДополнительныеПараметрыПоДоговору</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорСтроительногоПодряда</Name>
					<Comment>// Признак строительного договора</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименениеПБУ22008</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредусмотреныГарантийныеУдержанияПоДоговору</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентГарантийныхУдержаний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГарантийныхУдержаний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаГарантийныхУдержаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяБюджетаБДР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяБДДСАвансовогоПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяБДДСОсновногоПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяБДДСГарантийногоУдержания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоРаботам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПроцентГарантийныхУдержанийПоРаботам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВидамРабот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПроцентГарантийныхУдержанийПоВидамРабот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорГарантийногоУдержания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокАванса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокКредита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Детализация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоРабочимДням</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроцентГарантийныхУдержанийПоРаботам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПроцентаГарантийногоУдержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГарантийногоУдержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКредита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокКредита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроцентГарантийныхУдержанийПоВидамРабот</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПроцентаГарантийногоУдержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГарантийногоУдержания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокАванса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКредита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокКредита</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_УсловияАктированияФинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_УсловияАктированияФинансирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УсловияАктированияСЗаказчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ГрафикиАктированияФинансирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияФинансированияСЗаказчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ГрафикиАктированияФинансирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияАктированияСПодрядчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ГрафикиАктированияФинансирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияФинансированияСПодрядчиком</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ГрафикиАктированияФинансирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияФинансированияМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ГрафикиАктированияФинансирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияФинансированияТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ГрафикиАктированияФинансирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияФинансированияТехники</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ГрафикиАктированияФинансирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Импорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВвозИзЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДавальцем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПереработчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоклажедателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СХранителем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ДополнительныеПараметрыПоДоговору/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыФормы;

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура 	ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) И НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
		ПоказатьПредупреждение(,"Документ можно создавать только из справочника ""Договоры с контрагентами""!",30);
		Отказ = Истина;
		Возврат;
	КонецЕсли;  	
	
	ПараметрыФормы = СтруктураПараметрыФормы();
	
	ЗаполнитьДанныеФормыНаКлиенте();
	
	ЗаполнитьДополнительныеРеквизитыТабличнойЧасти();
	
	ЗаполнитьНадписьЭтаповОплаты();
	
КонецПроцедуры

&НаСервере
Процедура 	ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)						
	
	Если Параметры.Свойство("Договор") И ЗначениеЗаполнено(Параметры.Договор) Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
			Объект.Договор = Параметры.Договор;
			Объект.СуммаДоговора = Объект.Договор.Сумма;
			Объект.Организация = Объект.Договор.Организация;	
			Объект.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(Объект.СуммаДоговора,Объект.Договор.СтавкаНДС,Истина);
			Объект.СуммаБезНДС = Объект.СуммаДоговора - Объект.СуммаНДС; 		
			ЗаполнитьДанныеФормыНаСервере();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора" Тогда
		Объект.ДоговорГарантийногоУдержания = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ДополнительноеСоглашениеПриИзменении(Элемент)						
	ОбновитьФормуНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура 	ПредусмотреныГарантийныеУдержанияПоДоговоруПриИзменении(Элемент)		
	ОбновитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура 	ДоговорСтроительногоПодрядаПриИзменении(Элемент)						
	ОбновитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура 	ПоРаботамПриИзменении(Элемент)											
	ОбновитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура 	ПоВидамРаботПриИзменении(Элемент)										
	ОбновитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура 	УчитыватьПроцентГарантийныхУдержанийПоРаботамПриИзменении(Элемент)		
	ОбновитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура 	УчитыватьПроцентГарантийныхУдержанийПоВидамРаботПриИзменении(Элемент)	
	ОбновитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорРодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора  	= Новый Структура("Контрагент", ПараметрыФормы.Контрагент);
	ПараметрыОткрытия 	= Новый Структура("Отбор", 		ЗначениеОтбора);
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора", ПараметрыОткрытия,,,,, Новый ОписаниеОповещения("ДоговорРодительНачалоВыбораЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорРодительНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт	
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Объект.ДоговорРодитель) = ТипЗнч(Результат) Тогда
		Объект.ДоговорРодитель 		= Результат;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДоговора(Команда)												
	
	ТабДокРезультат = ТабДокРезультат_СвязанныеДоговора(Объект.Дата, Объект.ОбъектСтроительства);
	
	ФормаОтчета = ПолучитьФорму("Отчет.УСОERP_СвязанныеДоговоры.Форма");
	ФормаОтчета.ОтчетТабличныйДокумент = ТабДокРезультат;
	ФормаОтчета.Элементы.ОтчетТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь;
	ФормаОтчета.Элементы.ОтчетТабличныйДокумент.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	ФормаОтчета.Открыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТабДокРезультат_СвязанныеДоговора(Дата, ОбъектСтроительства)			
	
	ОтчетОбъект = Отчеты.УСОERP_СвязанныеДоговоры.Создать();
	
	Схема 		= ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки 	= Схема.НастройкиПоУмолчанию;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОбъектСтроительства", 	ОбъектСтроительства);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", 				Дата);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = КомпоновщикМакета.Выполнить(Схема, Настройки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет);
	
	ТабДокРезультат = Новый ТабличныйДокумент;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДокРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТабДокРезультат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

#КонецОбласти
#Область ОбработчикиПредставленияФормы

&НаКлиенте
Процедура 	ОбновитьФорму()															
	ОбновитьФормуНаСервере();	
КонецПроцедуры

&НаСервере
Процедура 	ОбновитьФормуНаСервере()												
	
	Элементы.ДоговорРодитель.Видимость 						      = Объект.ДополнительноеСоглашение;
	//Элементы.ГруппаГарантийныеУдержания.Видимость 		          = Константы.УСОERP_ИспользоватьГарантийныеУдержания.Получить();
	//Элементы.ПроцентГарантийныхУдержаний.Видимость 			      = Объект.ПредусмотреныГарантийныеУдержанияПоДоговору;
	//Элементы.СрокГарантийныхУдержаний.Видимость 			      = Объект.ПредусмотреныГарантийныеУдержанияПоДоговору;
	//Элементы.ДоговорГарантийногоУдержания.Видимость 	          = Объект.ПредусмотреныГарантийныеУдержанияПоДоговору;
	//Элементы.ГруппаФинансовогоУчетаГарантийныхУдержаний.Видимость = Объект.ПредусмотреныГарантийныеУдержанияПоДоговору;
	
	Элементы.ГруппаПроцентГарантийныхУдержанийПоВидамРабот.Видимость = Объект.Детализация = 2;
	
	Элементы.ГруппаПроцентГарантийныхУдержанийПоРаботам.Видимость = Объект.Детализация = 1;
	
	//Элементы.ПоРаботам.Видимость 							      = Объект.ДоговорСтроительногоПодряда;
	//Объект.ПоРаботам										      = ?(Не Элементы.ПоРаботам.Видимость, Ложь, Объект.ПоРаботам);
	//Элементы.УчитыватьПроцентГарантийныхУдержанийПоРаботам.Видимость 		= Объект.ПоРаботам;
	//Объект.УчитыватьПроцентГарантийныхУдержанийПоРаботам 	      = ?(НЕ Элементы.УчитыватьПроцентГарантийныхУдержанийПоРаботам.Видимость, Ложь, Объект.УчитыватьПроцентГарантийныхУдержанийПоРаботам);
	//
	//Элементы.ПоВидамРабот.Видимость 						      = НЕ Объект.ДоговорСтроительногоПодряда;
	//Объект.ПоВидамРабот 									      = ?(Не Элементы.ПоВидамРабот.Видимость, Ложь, Объект.ПоВидамРабот);
	//Элементы.УчитыватьПроцентГарантийныхУдержанийПоВидамРабот.Видимость 	= Объект.ПоВидамРабот;
	//Объект.УчитыватьПроцентГарантийныхУдержанийПоВидамРабот       = ?(НЕ Элементы.УчитыватьПроцентГарантийныхУдержанийПоВидамРабот.Видимость, Ложь, Объект.УчитыватьПроцентГарантийныхУдержанийПоВидамРабот);
	//
	//Элементы.ГруппаПроцентГарантийныхУдержанийПоРаботам.Видимость 			= Объект.УчитыватьПроцентГарантийныхУдержанийПоРаботам;
	//Элементы.ГруппаПроцентГарантийныхУдержанийПоВидамРабот.Видимость 		= Объект.УчитыватьПроцентГарантийныхУдержанийПоВидамРабот;
	
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиЗаполненияДанныхФормы

&НаКлиенте
Функция СтруктураПараметрыФормы()												
	
	ПараметрыФормы = СтруктураПараметрыФормыНаСервере();
	
	ПараметрыФормы.Вставить("Договор", 	Объект.ДоговорРодитель);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаСервере
Функция СтруктураПараметрыФормыНаСервере()										
	
	ПараметрыФормы 		= Новый Структура;	
	
	ПараметрыФормы.Вставить("Отказ", 	Ложь);	
	ПараметрыФормы.Вставить("Контрагент", Объект.Договор.Контрагент);	
	
	ЗаполнитьДоговорыССубподрядчикомСЗаказчиком(ПараметрыФормы, Объект.ДоговорРодитель); 
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура 	ЗаполнитьДанныеФормыНаКлиенте()											
	
	ДобавитьТЧДокументыПоДоговору(ПараметрыФормы);	
	
КонецПроцедуры

&НаСервере
Процедура 	ДобавитьТЧДокументыПоДоговору(ПараметрыФормы)							
	
	Если ПараметрыФормы.Свойство("ДокументыПоДоговору") И ПараметрыФормы.ДокументыПоДоговору.Количество() <> 0 Тогда
		
		ТипДоговора = Объект.ДоговорРодитель.ТипДоговора;
		
		МассивТиповДокументов = Новый Массив;
		МассивТиповДокументов.Добавить(Тип("ДокументСсылка.УСОERP_ДоговорССубподрядчиком"));
		МассивТиповДокументов.Добавить(Тип("ДокументСсылка.УСОERP_ДоговорСЗаказчиком"));
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ТЧДокументыПоДоговору", 	Новый ОписаниеТипов("ТаблицаЗначений")));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДокументПоДоговору", 		Новый ОписаниеТипов(МассивТиповДокументов), "ТЧДокументыПоДоговору"));
		
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов); 
		
		ГруппаФормы = Элементы.Добавить("ГруппаТЧДокументыПоДоговору", Тип("ГруппаФормы"), Элементы.Страницы);
		Если ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком 
			ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.СПереработчиком Тогда
			ГруппаФормы.Заголовок = "Договоры с субподрядчиками";
		ИначеЕсли ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем 
			ИЛИ ТипДоговора = Перечисления.ТипыДоговоров.СДавальцем Тогда
			ГруппаФормы.Заголовок = "Договоры с заказчиком";
		Иначе
			ГруппаФормы.Заголовок = "Договоры";
		КонецЕсли;
		
		ТаблицаФормы = Элементы.Добавить("ТЧДокументыПоДоговору", Тип("ТаблицаФормы"), ГруппаФормы); 
		ТаблицаФормы.ПутьКДанным 				= "ТЧДокументыПоДоговору"; 
		ТаблицаФормы.ПоложениеКоманднойПанели 	= ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ТаблицаФормы.ТолькоПросмотр				= Истина;
		
		НоваяКолонка = Элементы.Добавить("ДокументПоДоговору", Тип("ПолеФормы"), ТаблицаФормы);
		НоваяКолонка.Вид 			= ВидПоляФормы.ПолеВвода;
		НоваяКолонка.Заголовок 		= "Документы по договору"; 
		НоваяКолонка.ПутьКДанным 	= "ТЧДокументыПоДоговору.ДокументПоДоговору";
		НоваяКолонка.КнопкаОткрытия = Истина;
		
		ТЗ_ДокументыПоДоговору = РеквизитФормыВЗначение("ТЧДокументыПоДоговору");
		Пока ТЗ_ДокументыПоДоговору.Количество() < ПараметрыФормы.ДокументыПоДоговору.Количество() Цикл
			ТЗ_ДокументыПоДоговору.Добавить();
		КонецЦикла;
		ТЗ_ДокументыПоДоговору.ЗагрузитьКолонку(ПараметрыФормы.ДокументыПоДоговору, "ДокументПоДоговору");
		ЗначениеВРеквизитФормы(ТЗ_ДокументыПоДоговору, "ТЧДокументыПоДоговору");
		
		ТаблицаФормы.УстановитьДействие("Выбор", "ВыборДокументПоДоговору");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура 	ВыборДокументПоДоговору(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)											
	
	ПоказатьЗначение(Новый ОписаниеОповещения("ПослеВыбораДокументаПоДоговору", ЭтотОбъект), Элемент.ТекущиеДанные.ДокументПоДоговору);
	
КонецПроцедуры

&НаКлиенте
Процедура 	ПослеВыбораДокументаПоДоговору(ДополнительныеПараметры) 		Экспорт	
	
	
	
КонецПроцедуры

&НаСервере
Процедура 	ЗаполнитьДанныеФормыНаСервере()											
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура 	ЗаполнитьДоговорыССубподрядчикомСЗаказчиком(ПараметрыФормы, Договор)	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_ДоговорССубподрядчикомРаботы.Ссылка КАК ДокументПоДоговору,
	|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.ПоступлениеЗатрат) КАК ПорядокДоходовРасходов
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_ДоговорССубподрядчиком.Работы КАК УСОERP_ДоговорССубподрядчикомРаботы
	|		ПО ДоговорыКонтрагентов.Ссылка = УСОERP_ДоговорССубподрядчикомРаботы.Ссылка.Договор
	|ГДЕ
	|	УСОERP_ДоговорССубподрядчикомРаботы.Ссылка.Проведен
	|	И ДоговорыКонтрагентов.Ссылка = &Договор
	|	И (ДоговорыКонтрагентов.Ссылка.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
	|			ИЛИ ДоговорыКонтрагентов.Ссылка.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПереработчиком))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	УСОERP_ДоговорСЗаказчикомРаботы.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.УСОERP_ПорядокДоходовРасходов.Реализация)
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_ДоговорСЗаказчиком.Работы КАК УСОERP_ДоговорСЗаказчикомРаботы
	|		ПО ДоговорыКонтрагентов.Ссылка = УСОERP_ДоговорСЗаказчикомРаботы.Ссылка.Договор
	|ГДЕ
	|	УСОERP_ДоговорСЗаказчикомРаботы.Ссылка.Проведен
	|	И ДоговорыКонтрагентов.Ссылка = &Договор
	|	И (ДоговорыКонтрагентов.Ссылка.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|			ИЛИ ДоговорыКонтрагентов.Ссылка.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СДавальцем))";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	ТЗ_ДокументыПоДоговору = Запрос.Выполнить().Выгрузить();
	
	ПараметрыФормы.Вставить("ДокументыПоДоговору", ТЗ_ДокументыПоДоговору.ВыгрузитьКолонку("ДокументПоДоговору"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентГарантийныхУдержанийПоРаботамРаботаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ДокументУтверждения) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборРаботОбработкаВыбора",ЭтотОбъект);
		
		ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаВыбора",Новый Структура("ДокументУтверждения",Объект.ДокументУтверждения),ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли ЗначениеЗаполнено(Объект.ОбъектСтроительства) Тогда
		//СтандартнаяОбработка = Ложь;
		ПараметрыОтбора = Новый Структура("СценарийПланирования", ВернутьСценарийПланирования(Объект.ОбъектСтроительства));
		ФормаВыбора = ПолучитьФорму("Справочник.УСОERP_СтроительныеРаботы.ФормаВыбора", ПараметрыОтбора, Элемент);
		ФормаВыбора.Открыть();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРаботОбработкаВыбора(ВыбранноеЗначение,ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПроцентГарантийныхУдержанийПоРаботам.ТекущиеДанные.Работа = ВыбранноеЗначение;
	
КонецПроцедуры   

&НаСервере
Функция ВернутьСценарийПланирования(ОбъектСтроительства)
	Если ЗначениеЗаполнено(ОбъектСтроительства) Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ОбъектСтроительства", Объект.ОбъектСтроительства);
		Запрос.Текст ="ВЫБРАТЬ
		|	УСОERP_СценарииПланированияПроектовСтроительства.Ссылка КАК СценарийПланирования
		|ИЗ
		|	Справочник.УСОERP_СценарииПланированияПроектовСтроительства КАК УСОERP_СценарииПланированияПроектовСтроительства
		|ГДЕ
		|	УСОERP_СценарииПланированияПроектовСтроительства.Владелец = &ОбъектСтроительства
		|	И УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыСценариевПланирования.Рабочий)";
		результат = Запрос.Выполнить().Выбрать();
		Если результат.Следующий() Тогда
			Возврат результат.СценарийПланирования;
		КонецЕсли;	
		Возврат Справочники.УСОERP_СценарииПланированияПроектовСтроительства.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура 	СуммаДоговораПриИзменении(Элемент)
	ПересчитатьСуммуНДС();
	ПересчитатьСуммыДополнительныхПараметров();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуНДС()
	
	СтавкаНДС = ?(ЗначениеЗаполнено(Объект.Договор.СтавкаНДС),Объект.Договор.СтавкаНДС,Перечисления.СтавкиНДС.БезНДС); 
	Объект.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(Объект.СуммаДоговора, СтавкаНДС, Ложь);
	Объект.СуммаБезНДС = Объект.СуммаДоговора-Объект.СуммаНДС;
	
КонецПроцедуры  

&НаКлиенте
Процедура 	СуммаНДСПриИзменении(Элемент)
	ПересчитатьСуммыДополнительныхПараметров();
КонецПроцедуры

&НаКлиенте
Процедура 	СуммаБезНДСПриИзменении(Элемент)
	ПересчитатьСуммыДополнительныхПараметров();
КонецПроцедуры

&НаКлиенте
Процедура 	ПересчитатьСуммыДополнительныхПараметров()
	Если Объект.СуммаДоговора >= ?(Объект.СуммаНДС, Объект.СуммаНДС, 0) Тогда
		Объект.СуммаБезНДС = Объект.СуммаДоговора - ?(Объект.СуммаНДС, Объект.СуммаНДС, 0);
	Иначе
		Объект.СуммаБезНДС = 0;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорГарантийногоУдержанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбора", СтруктураОтбора(Объект.Договор), ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураОтбора(Договор)
	
	СтруктураВозврата = Новый Структура;
	ЗначениеОтбора = Новый Структура("ТипДоговора, Контрагент", Договор.ТипДоговора, Договор.Контрагент);
	СтруктураВозврата = Новый Структура("Отбор", ЗначениеОтбора);

	Возврат СтруктураВозврата;
	
КонецФункции	

#Область ДокументУтверждения

&НаКлиенте
Процедура ЗаполнитьДополнительныеРеквизитыТабличнойЧасти()
	
	Для Каждого СтрокаТЧ ИЗ Объект.ПроцентГарантийныхУдержанийПоВидамРабот Цикл
		
		СтрокаТЧ.ПроцентВсего = СтрокаТЧ.ЗначениеПроцентаГарантийногоУдержания+СтрокаТЧ.ПроцентАванса+СтрокаТЧ.ПроцентКредита;

	КонецЦикла;
	
	Для Каждого СтрокаТЧ ИЗ Объект.ПроцентГарантийныхУдержанийПоРаботам Цикл
		
		СтрокаТЧ.ПроцентВсего = СтрокаТЧ.ЗначениеПроцентаГарантийногоУдержания+СтрокаТЧ.ПроцентАванса+СтрокаТЧ.ПроцентКредита;
		
	КонецЦикла;	
	
КонецПроцедуры 
&НаКлиенте
Процедура ПроцентГарантийныхУдержанийПоРаботамПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПроцентГарантийныхУдержанийПоРаботамПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекСтрока = Элементы.ПроцентГарантийныхУдержанийПоРаботам.ТекущиеДанные;
	ТекСтрока.ПроцентВсего = ТекСтрока.ПроцентАванса+ТекСтрока.ЗначениеПроцентаГарантийногоУдержания+ТекСтрока.ПроцентКредита;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентГарантийныхУдержанийПоВидамРаботПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекСтрока = Элементы.ПроцентГарантийныхУдержанийПоВидамРабот.ТекущиеДанные;
		
		ТекСтрока.ПроцентАванса = Объект.ПроцентАванса;
		ТекСтрока.СрокАванса = Объект.СрокАванса;
		ТекСтрока.ЗначениеПроцентаГарантийногоУдержания = Объект.ПроцентГарантийныхУдержаний;
		ТекСтрока.СрокГарантийногоУдержания = Объект.СрокГарантийныхУдержаний;
		ТекСтрока.ПроцентКредита = Объект.ПроцентКредита;
		ТекСтрока.СрокКредита = Объект.СрокКредита;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроцентГарантийныхУдержанийПоРаботамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекСтрока = Элементы.ПроцентГарантийныхУдержанийПоРаботам.ТекущиеДанные;
		
		ТекСтрока.ПроцентАванса = Объект.ПроцентАванса;
		ТекСтрока.СрокАванса = Объект.СрокАванса;
		ТекСтрока.ЗначениеПроцентаГарантийногоУдержания = Объект.ПроцентГарантийныхУдержаний;
		ТекСтрока.СрокГарантийногоУдержания = Объект.СрокГарантийныхУдержаний;
		ТекСтрока.ПроцентКредита = Объект.ПроцентКредита;
		ТекСтрока.СрокКредита = Объект.СрокКредита;
		//СтруктураОплаты = ПолучитьСтруктуруОплаты();
		//ЗаполнитьЗначенияСвойств(ТекСтрока,СтруктураОплаты);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруОплаты()
	
	СтруктураОплаты = Новый Структура("ПроцентАванса,СрокАванса,ПроцентГарантийныхУдержаний,СрокГарантийныхУдержаний,ПроцентКредита,СрокКредита",0,0,0,0,0,0);
	
	ТаблицаГрафикаОплат = Документы.УСОERP_ДополнительныеПараметрыПоДоговору.ПолучитьПараметрыГрафикаОплатПоДоговору(Объект.Договор,Объект.ДокументУтверждения);
	
	Для Каждого СтрокаГрафика ИЗ ТаблицаГрафикаОплат Цикл
		
		Если СтрокаГрафика.ВариантОплаты = "Аванс" Тогда
			
			СтруктураОплаты.ПроцентАванса = СтрокаГрафика.ПроцентПлатежа;
			СтруктураОплаты.СрокАванса = СтрокаГрафика.Сдвиг;
			
		КонецЕсли;
		
		Если СтрокаГрафика.ВариантОплаты = "Кредит" Тогда
			
			СтруктураОплаты.ПроцентКредита = СтрокаГрафика.ПроцентПлатежа;
			СтруктураОплаты.СрокКредита = СтрокаГрафика.Сдвиг;
			
		КонецЕсли;
		
		Если СтрокаГрафика.ВариантОплаты = "ГУ" Тогда
			
			СтруктураОплаты.ПроцентГарантийныхУдержаний = СтрокаГрафика.ПроцентПлатежа;
			СтруктураОплаты.СрокГарантийныхУдержаний = СтрокаГрафика.Сдвиг;
			
		КонецЕсли; 		
		
	КонецЦикла;  	
	
	Возврат СтруктураОплаты;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьДополнительныеРеквизитыТабличнойЧасти();
КонецПроцедуры

&НаКлиенте
Процедура ПроцентГарантийныхУдержанийПоВидамРаботПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ЗаполнитьДополнительныеРеквизитыТабличнойЧасти();

КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
	
	Объект.ДокументУтверждения = УСОERP_ЗащищенныеФункцииСервер.ПолучитьПоследнийДокументУтверждения(Объект.ОбъектСтроительства,Объект.Организация); 
	ДокументУтвержденияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияПриИзменении(Элемент)
	
	Объект.ПроцентГарантийныхУдержанийПоВидамРабот.Очистить();
	Объект.ПроцентГарантийныхУдержанийПоРаботам.Очистить();
	
	СтруктураОплаты = ПолучитьСтруктуруОплаты();
	
	ЗаполнитьЗначенияСвойств(Объект,СтруктураОплаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГрафикуФинансирования(Команда)
	
	СписокДанных = ПолучитьСписокГрафиковФинансирования();
	
	Если СписокДанных.Количество() = 0 Тогда
		ПоказатьПредупреждение(,"Нет графиков финансирования для объекта "+Объект.ОбъектСтроительства);
		Возврат;
	КонецЕсли;
	
	Если СписокДанных.Количество() = 1 Тогда
		
		ЗаполнитьПоГрафикуПродолжение(СписокДанных.Получить(0).Значение,Новый Структура);
		
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоГрафикуПродолжение",ЭтотОбъект);
		
		СписокДанных.ПоказатьВыборЭлемента(ОписаниеОповещения);	
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура  ЗаполнитьПоГрафикуПродолжение(ВыбранноеЗначение,ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГрафикФинансирования = ?(ТипЗнч(ВыбранноеЗначение) = Тип("ЭлементСпискаЗначений"),ВыбранноеЗначение.Значение,ВыбранноеЗначение);
	
	СтруктураПараметров = Новый Структура("ГрафикФинансирования",ГрафикФинансирования);
	
	Если Объект.ПроцентАванса+Объект.СрокАванса+Объект.ПроцентКредита+Объект.СрокКредита+Объект.ПроцентГарантийныхУдержаний+Объект.СрокГарантийныхУдержаний = 0 Тогда
		
		ЗаполнитьПоГрафикуЗавершение(КодВозвратаДиалога.Да,СтруктураПараметров);
		
	Иначе		
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоГрафикуЗавершение",ЭтотОбъект,СтруктураПараметров); 		
		
		ПоказатьВопрос(ОписаниеОповещения,"Данные графика будут перезаполнены, продолжить?",РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;  	
	
КонецПроцедуры  

&НаКлиенте
Процедура  ЗаполнитьПоГрафикуЗавершение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да  Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоГрафикуФинансированияНаСервере(ДопПараметры.ГрафикФинансирования);
	
	ЗаполнитьНадписьЭтаповОплаты();
	
	Модифицированность = Истина;	
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоГрафикуФинансированияНаСервере(ГрафикФинансирования);
	
	Объект.ПроцентАванса = 0;
	Объект.СрокАванса = 0;
	Объект.ПроцентКредита = 0;
	Объект.СрокКредита = 0;
	Объект.ПроцентГарантийныхУдержаний = 0;
	Объект.СрокГарантийныхУдержаний = 0;
	
	Для Каждого СтрокаТЧ ИЗ ГрафикФинансирования.Этапы Цикл
		
		Если СтрокаТЧ.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.АвансДоОбеспечения ИЛИ
			СтрокаТЧ.ВариантОплаты = Перечисления.ВариантыОплатыПоставщику.АвансДоПодтверждения Тогда
			
			Объект.ПроцентАванса = СтрокаТЧ.ПроцентПлатежа;
			Объект.СрокАванса = СтрокаТЧ.Сдвиг;
			
		КонецЕсли;
		
		
		Если СтрокаТЧ.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки ИЛИ
			СтрокаТЧ.ВариантОплаты = Перечисления.ВариантыОплатыПоставщику.КредитПослеПоступления Тогда
			
			Объект.ПроцентКредита = СтрокаТЧ.ПроцентПлатежа;
			Объект.СрокКредита = СтрокаТЧ.Сдвиг;
			
		КонецЕсли;  		
		
		Если СтрокаТЧ.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.УСОERP_ГарантийноеУдержание ИЛИ
			СтрокаТЧ.ВариантОплаты = Перечисления.ВариантыОплатыПоставщику.УСОERP_ГарантийноеУдержание Тогда
			
			Объект.ПроцентГарантийныхУдержаний = СтрокаТЧ.ПроцентПлатежа;
			Объект.СрокГарантийныхУдержаний = СтрокаТЧ.Сдвиг;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьТабличныеЧастиПоГрафику(); 	
	
КонецПроцедуры 

&НаСервере
Процедура  ЗаполнитьТабличныеЧастиПоГрафику()
	
	Возврат;
	
	Для Каждого СтрокаТЧ ИЗ Объект.ПроцентГарантийныхУдержанийПоВидамРабот Цикл
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,Объект,"ПроцентКредита,СрокКредита,ПроцентАванса,СрокАванса");
		СтрокаТЧ.ЗначениеПроцентаГарантийногоУдержания = Объект.ПроцентГарантийныхУдержаний;
		СтрокаТЧ.СрокГарантийногоУдержания = Объект.СрокГарантийныхУдержаний;
		
	КонецЦикла;
	
	Для Каждого СтрокаТЧ ИЗ Объект.ПроцентГарантийныхУдержанийПоРаботам Цикл
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,Объект,"ПроцентКредита,СрокКредита,ПроцентАванса,СрокАванса");
		СтрокаТЧ.ЗначениеПроцентаГарантийногоУдержания = Объект.ПроцентГарантийныхУдержаний;
		СтрокаТЧ.СрокГарантийногоУдержания = Объект.СрокГарантийныхУдержаний; 
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция  ПолучитьСписокГрафиковФинансирования()
	
	СписокВозврата = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектСтроительства",Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("ЭтоЗаказчик",Объект.Договор.ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ЭтоЗаказчик
	|			ТОГДА УСОERP_УсловияАктированияФинансирования.УсловияФинансированияСЗаказчиком
	|		ИНАЧЕ УСОERP_УсловияАктированияФинансирования.УсловияФинансированияСПодрядчиком
	|	КОНЕЦ КАК УсловияФинансирования
	|ИЗ
	|	РегистрСведений.УСОERP_УсловияАктированияФинансирования КАК УСОERP_УсловияАктированияФинансирования
	|ГДЕ
	|	УСОERP_УсловияАктированияФинансирования.ОбъектСтроительства = &ОбъектСтроительства
	|	И УСОERP_УсловияАктированияФинансирования.Работа = ЗНАЧЕНИЕ(Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА &ЭтоЗаказчик
	|				ТОГДА УСОERP_УсловияАктированияФинансирования.УсловияФинансированияСЗаказчиком <> ЗНАЧЕНИЕ(Справочник.УСОERP_ГрафикиАктированияФинансирования.ПустаяСсылка)
	|			ИНАЧЕ УСОERP_УсловияАктированияФинансирования.УсловияФинансированияСПодрядчиком <> ЗНАЧЕНИЕ(Справочник.УСОERP_ГрафикиАктированияФинансирования.ПустаяСсылка)
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА &ЭтоЗаказчик
	|			ТОГДА УСОERP_УсловияАктированияФинансирования.УсловияФинансированияСЗаказчиком
	|		ИНАЧЕ УСОERP_УсловияАктированияФинансирования.УсловияФинансированияСПодрядчиком
	|	КОНЕЦ";
	
	СписокВозврата.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УсловияФинансирования"));	
	
	Возврат СписокВозврата;
	
КонецФункции  

&НаКлиенте
Процедура ДекорацияЭтапыОплатыНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура("ПроцентАванса,СрокАванса,ПроцентГарантийныхУдержаний,СрокГарантийныхУдержаний,ПроцентКредита,СрокКредита,ПоРабочимДням");
	ЗаполнитьЗначенияСвойств(ПараметрыОткрытия,Объект);
	//ТипДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор,"ТипДоговора");
	ПараметрыОткрытия.Вставить("ТипДоговора",ТипДоговора(Объект.Договор));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЭтапыОплатыПродолжение",ЭтотОбъект);
	
	ОткрытьФорму("Документ.УСОERP_ДополнительныеПараметрыПоДоговору.Форма.ФормаЭтаповОплаты",ПараметрыОткрытия,ЭтотОбъект,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНадписьЭтаповОплаты()
	
	Если Объект.ПроцентАванса+Объект.ПроцентКредита+Объект.ПроцентГарантийныхУдержаний = 0 Тогда
		
		Элементы.ДекорацияЭтапыОплаты.Заголовок = "Этапы оплаты: Не указаны";
		Элементы.ДекорацияЭтапыОплаты.ЦветТекста = WebЦвета.Красный;
		
	Иначе
		
		Элементы.ДекорацияЭтапыОплаты.Заголовок = "Этапы оплаты: Аванс "+Объект.ПроцентАванса+" % ("+Объект.СрокАванса+ "дн), Кредит "+Объект.ПроцентКредита+" %("+Объект.СрокКредита+" дн), ГУ "+Объект.ПроцентГарантийныхУдержаний+" %("+Объект.СрокГарантийныхУдержаний+" дн), "+?(Объект.ПоРабочимДням,"по рабочим дням","по календарным дням");
		
		Элементы.ДекорацияЭтапыОплаты.ЦветТекста = WebЦвета.Синий;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТипДоговора(Договор)
	
	Возврат Договор.ТипДоговора;
	
КонецФункции   

&НаКлиенте
Процедура ЭтапыОплатыПродолжение(ВыбранноеЗначение,ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Таблица = ВыбранноеЗначение.Таблица; 	
	
	Объект.ПроцентАванса = Таблица.Получить(0).Процент;
	Объект.СрокАванса = Таблица.Получить(0).Сдвиг;
	
	Объект.ПроцентКредита = Таблица.Получить(1).Процент;
	Объект.СрокКредита = Таблица.Получить(1).Сдвиг;
	
	Объект.ПроцентГарантийныхУдержаний = Таблица.Получить(2).Процент;
	Объект.СрокГарантийныхУдержаний = Таблица.Получить(2).Сдвиг;
	
	Объект.ПоРабочимДням = ВыбранноеЗначение.ПоРабочимДням;
	
	Модифицированность = Истина;
	ЗаполнитьНадписьЭтаповОплаты();
	
	ЗаполнитьТабличныеЧастиПоГрафику();
	
КонецПроцедуры 

#КонецОбласти

#КонецОбласти
